Show / Hide Table of Contents
Enum PositionRelatedTo
Position, to which is input related to.
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum PositionRelatedTo
Fields
 Name |  Description
 Axis
Position is related to any axis.
 LeftSide
Position is related to the left side of main plate.
 Profile
Position is related to the related profile (cross-section) bounding box. In this case is Rows and Cols position are on the positive axes (top, right), RowsNegative and ColsNegative are on the negative axes.
 RightSide
Position is related to the right side of main plate.
 TopOfSteel
Position is related to top of steel.
 Improve this Doc
 View Source